[
  {
    "topic": "Hungarian cuisine",
    "question": "Which Hungarian dishes have side dishes that are considered almost mandatory, and what are these sides?",
    "expected": "Csirkepaprikás is typically served with nokedli, while sour cream and bread are almost always paired with töltött káposzta.",
    "reference": "Main dishes may \"require\" a side dish (köret) or not. It is unusual to violate this convention. The side dish is most commonly potato in various styles, but rice or steamed vegetables are also popular. Some foods have a customary side dish (e.g., csirkepaprikás 'paprika chicken' is almost always eaten with small dumplings similar to gnocchi (nokedli), while others may take any side dish (e.g., rántott sajt 'fried cheese'). Some dishes also have toppings or bread on the side considered almost mandatory, for example, the sour cream and bread with töltött káposzta 'stuffed cabbage'.\nRecently, Hungarian chefs have become more creative, so Hungarian dishes prepared for tourists may seem unusual to Hungarians who are familiar with more traditional preparations.\nGoulash is a famous Hungarian dish. Other famous Hungarian meat stews include paprikás, a thicker stew with meat simmered in thick, creamy, paprika-flavored gravy, and pörkölt, a stew with boneless meat (usually beef or pork), onion, and sweet paprika powder, both served with nokedli or galuska (small dumplings). In some old-fashioned dishes, fruits such as plums and apricots are cooked with meat or in piquant sauces/stuffings for game, roasts and other cuts. Various kinds of noodles, dumplings, potatoes, and rice are commonly served as a side dish. Hungarian dry sausages (kolbász) and winter salami are also widely eaten.\n\nRindsuppe (beef soup), a clear soup with golden colour\nTafelspitz, beef boiled in broth (soup), often served with apple and horseradish and chives sauce\nGulasch (goulash), a hotpot similar to Hungarian pörkölt. Austrian goulash is often eaten with rolls, bread or dumplings (Semmelknödel).\nBeuschel, a ragout containing lungs and heart\nLiptauer, a spicy cheese spread, eaten on a slice of bread\nSelchfleisch, meat that is smoked, then cooked, served with Sauerkraut and dumplings\nPowidl, a thick sweet jam made from plums\nApfelstrudel, apple strudel\nTopfenstrudel, cream cheese strudel\nMillirahmstrudel, milk-cream strudel\nPalatschinken, pancakes similar to French crêpes, filled with jam and sprinkled with sugar or other toppings. They are also served in savoury versions, such as with spinach and cheese.\nKaiserschmarrn, soft, fluffy pancake ripped into bites and slightly roasted in a pan, served with compote, applesauce or stewed plums.\nGermknödel, a fluffy yeast dough dumpling filled with plum jam (Powidl), garnished with melted butter and a mix of poppy seeds and powdered sugar, sometimes served with vanilla cream\nMarillenknödel, a dumpling stuffed with an apricot and covered with streusel and powdered sugar. The dough is made of potatoes or Topfen.\n\nHungarian or Magyar cuisine (Hungarian: Magyar konyha) is the cuisine characteristic of the nation of Hungary, and its primary ethnic group, the Magyars. Hungarian cuisine has been described as being the spiciest cuisine in Europe. This can largely be attributed to the use of their piquant native spice, Hungarian paprika, in many of their dishes. A mild version of the spice, Hungarian sweet paprika, is commonly used as an alternative. Traditional Hungarian dishes are primarily based on meats, seasonal vegetables, fruits, bread, and dairy products."
  },
  {
    "topic": "Hungarian cuisine",
    "question": "What traditional Hungarian dishes are characterized by the use of paprika and meat, and what are their common accompaniments?",
    "expected": "Goulash, paprikás, and pörkölt are traditional dishes using paprika and meat, often served with nokedli or galuska.",
    "reference": "Main dishes may \"require\" a side dish (köret) or not. It is unusual to violate this convention. The side dish is most commonly potato in various styles, but rice or steamed vegetables are also popular. Some foods have a customary side dish (e.g., csirkepaprikás 'paprika chicken' is almost always eaten with small dumplings similar to gnocchi (nokedli), while others may take any side dish (e.g., rántott sajt 'fried cheese'). Some dishes also have toppings or bread on the side considered almost mandatory, for example, the sour cream and bread with töltött káposzta 'stuffed cabbage'.\nRecently, Hungarian chefs have become more creative, so Hungarian dishes prepared for tourists may seem unusual to Hungarians who are familiar with more traditional preparations.\nGoulash is a famous Hungarian dish. Other famous Hungarian meat stews include paprikás, a thicker stew with meat simmered in thick, creamy, paprika-flavored gravy, and pörkölt, a stew with boneless meat (usually beef or pork), onion, and sweet paprika powder, both served with nokedli or galuska (small dumplings). In some old-fashioned dishes, fruits such as plums and apricots are cooked with meat or in piquant sauces/stuffings for game, roasts and other cuts. Various kinds of noodles, dumplings, potatoes, and rice are commonly served as a side dish. Hungarian dry sausages (kolbász) and winter salami are also widely eaten.\n\nRindsuppe (beef soup), a clear soup with golden colour\nTafelspitz, beef boiled in broth (soup), often served with apple and horseradish and chives sauce\nGulasch (goulash), a hotpot similar to Hungarian pörkölt. Austrian goulash is often eaten with rolls, bread or dumplings (Semmelknödel).\nBeuschel, a ragout containing lungs and heart\nLiptauer, a spicy cheese spread, eaten on a slice of bread\nSelchfleisch, meat that is smoked, then cooked, served with Sauerkraut and dumplings\nPowidl, a thick sweet jam made from plums\nApfelstrudel, apple strudel\nTopfenstrudel, cream cheese strudel\nMillirahmstrudel, milk-cream strudel\nPalatschinken, pancakes similar to French crêpes, filled with jam and sprinkled with sugar or other toppings. They are also served in savoury versions, such as with spinach and cheese.\nKaiserschmarrn, soft, fluffy pancake ripped into bites and slightly roasted in a pan, served with compote, applesauce or stewed plums.\nGermknödel, a fluffy yeast dough dumpling filled with plum jam (Powidl), garnished with melted butter and a mix of poppy seeds and powdered sugar, sometimes served with vanilla cream\nMarillenknödel, a dumpling stuffed with an apricot and covered with streusel and powdered sugar. The dough is made of potatoes or Topfen.\n\nHungarian or Magyar cuisine (Hungarian: Magyar konyha) is the cuisine characteristic of the nation of Hungary, and its primary ethnic group, the Magyars. Hungarian cuisine has been described as being the spiciest cuisine in Europe. This can largely be attributed to the use of their piquant native spice, Hungarian paprika, in many of their dishes. A mild version of the spice, Hungarian sweet paprika, is commonly used as an alternative. Traditional Hungarian dishes are primarily based on meats, seasonal vegetables, fruits, bread, and dairy products."
  },
  {
    "topic": "Budapest history",
    "question": "Which Roman settlement's location contributed to Budapest's strategic position on ancient trade routes linking Transdanubia with the Great Plain?",
    "expected": "Aquincum",
    "reference": "The history of Budapest began with an early Celtic settlement transformed by the Romans into the town of Aquincum, capital of Lower Pannonia in the 1st century. Following the foundation of Hungary in the late 9th century, the area was pillaged by the Mongols in 1241. It became royal seat in 1361, with Buda becoming one of the European centers of renaissance culture by the 15th century under Matthias Corvinus. The siege of Buda in 1541 was followed by nearly 150 years of Ottoman rule, and after the reconquest of Buda in 1686, the region entered a new age of prosperity, with Pest-Buda becoming a global city after the unification of Buda, Pest and Óbuda in 1873. By this time, Budapest had become the co-capital of the Austro-Hungarian Empire, a great power that dissolved in 1918 following World War I. The city was also the focal point of the Hungarian Revolution of 1848, Battle of Budapest in 1945, and Hungarian Revolution of 1956.\n\nBudapest is the capital and most populous city of Hungary. It is Hungary's primate city with 1.7 million inhabitants and its greater metro area has a population of about 3.3 million, representing one-third of the country's population and producing above 40% of the country's economic output. Budapest is the political, economic, and cultural center of the country, among the ten largest cities in the European Union and the second largest urban area in Central and Eastern Europe. Budapest stands on the River Danube and is strategically located at the center of the Pannonian Basin, lying on ancient trade routes linking the hills of Transdanubia with the Great Plain.\n\nThe Romans pulled out of the Hungarian plains in the 5th century AD to be succeeded by the Huns after fierce warfare. Upon the fragmentation of the Huns that resulted from the death of Attila the Hun, Germanic tribes (such as the Lombards) and the Avars occupied the area during the second Age of Migrations. The Avar Khaganate dominated Pannonia between the 6th and 9th centuries.\nFrom 829, Pannonia became part of Bulgaria following the collapse of the Avar Khaganate and a defeat of the forces of the Holy Roman Empire under Louis the Pious at the hands of a Bulgarian army under Omurtag. The Bulgarians built two frontier fortresses, Buda and Pest, on opposing sides of the Danube River. While other tribes spread across the entire Carpathian basin, the clan of Árpád settled down on Csepel Island, a large island in the Danube, and formed a shelter for the settlers who started agricultural works in what is the south part of Budapest today. It was under the Árpád dynasty that Hungary became a Christian state, ruled first from Esztergom and later from Székesfehérvár."
  },
  {
    "topic": "Budapest history",
    "question": "After the Romans withdrew from the Hungarian plains in the 5th century, which groups successively controlled the region before the Bulgarians established Buda and Pest?",
    "expected": "Huns, Germanic tribes (such as the Lombards), and Avars",
    "reference": "The history of Budapest began with an early Celtic settlement transformed by the Romans into the town of Aquincum, capital of Lower Pannonia in the 1st century. Following the foundation of Hungary in the late 9th century, the area was pillaged by the Mongols in 1241. It became royal seat in 1361, with Buda becoming one of the European centers of renaissance culture by the 15th century under Matthias Corvinus. The siege of Buda in 1541 was followed by nearly 150 years of Ottoman rule, and after the reconquest of Buda in 1686, the region entered a new age of prosperity, with Pest-Buda becoming a global city after the unification of Buda, Pest and Óbuda in 1873. By this time, Budapest had become the co-capital of the Austro-Hungarian Empire, a great power that dissolved in 1918 following World War I. The city was also the focal point of the Hungarian Revolution of 1848, Battle of Budapest in 1945, and Hungarian Revolution of 1956.\n\nBudapest is the capital and most populous city of Hungary. It is Hungary's primate city with 1.7 million inhabitants and its greater metro area has a population of about 3.3 million, representing one-third of the country's population and producing above 40% of the country's economic output. Budapest is the political, economic, and cultural center of the country, among the ten largest cities in the European Union and the second largest urban area in Central and Eastern Europe. Budapest stands on the River Danube and is strategically located at the center of the Pannonian Basin, lying on ancient trade routes linking the hills of Transdanubia with the Great Plain.\n\nThe Romans pulled out of the Hungarian plains in the 5th century AD to be succeeded by the Huns after fierce warfare. Upon the fragmentation of the Huns that resulted from the death of Attila the Hun, Germanic tribes (such as the Lombards) and the Avars occupied the area during the second Age of Migrations. The Avar Khaganate dominated Pannonia between the 6th and 9th centuries.\nFrom 829, Pannonia became part of Bulgaria following the collapse of the Avar Khaganate and a defeat of the forces of the Holy Roman Empire under Louis the Pious at the hands of a Bulgarian army under Omurtag. The Bulgarians built two frontier fortresses, Buda and Pest, on opposing sides of the Danube River. While other tribes spread across the entire Carpathian basin, the clan of Árpád settled down on Csepel Island, a large island in the Danube, and formed a shelter for the settlers who started agricultural works in what is the south part of Budapest today. It was under the Árpád dynasty that Hungary became a Christian state, ruled first from Esztergom and later from Székesfehérvár."
  },
  {
    "topic": "Climate change",
    "question": "How do the tactics of climate change denial campaigns compare to historical strategies used by the tobacco industry, and what specific rhetorical methods are employed?",
    "expected": "They are compared to the tobacco industry's denial of smoking hazards, using rhetorical tactics to create a false scientific controversy and downplay human causation.",
    "reference": "In the 1970s, oil companies published research that broadly concurred with the scientific community's view on climate change. Since then, for several decades, oil companies have been organizing a widespread and systematic climate change denial campaign to seed public disinformation, a strategy that has been compared to the tobacco industry's organized denial of the hazards of tobacco smoking. Some of the campaigns are carried out by the same people who previously spread the tobacco industry's denialist propaganda.\n\nClimate change threatens people with increased flooding, extreme heat, increased food and water scarcity, more disease, and economic loss. Human migration and conflict can also be a result. The World Health Organization calls climate change one of the biggest threats to global health in the 21st century. Societies and ecosystems will experience more severe risks without action to limit warming. Adapting to climate change through efforts like flood control measures or drought-resistant crops partially reduces climate change risks, although some limits to adaptation have already been reached. Poorer communities are responsible for a small share of global emissions, yet have the least ability to adapt and are most vulnerable to climate change.\n\nClimate change denial (also global warming denial) is a form of science denial characterized by rejecting, refusing to acknowledge, disputing, or fighting the scientific consensus on climate change, which is based on extensive and diverse evidence. Those promoting denial commonly use rhetorical tactics to give the appearance of a scientific controversy where none exists. Climate change denial includes raising unreasonable doubts about the extent to which climate change is caused by humans, its effects on nature and human society, and understating the costs of climate change adaptation while overstating the costs of mitigating it. To a lesser extent, climate change denial can also be implicit when people accept the science but fail to reconcile it with their belief or action. Several studies have analyzed these positions as forms of denialism, pseudoscience, or propaganda."
  },
  {
    "topic": "Climate change",
    "question": "What specific vulnerabilities do poorer communities face regarding climate change, and how does this relate to climate change denial tactics?",
    "expected": "Poorer communities, responsible for minimal emissions, face heightened vulnerability due to limited adaptation capacity, a risk exacerbated by denial tactics that downplay adaptation costs and overstate mitigation expenses.",
    "reference": "In the 1970s, oil companies published research that broadly concurred with the scientific community's view on climate change. Since then, for several decades, oil companies have been organizing a widespread and systematic climate change denial campaign to seed public disinformation, a strategy that has been compared to the tobacco industry's organized denial of the hazards of tobacco smoking. Some of the campaigns are carried out by the same people who previously spread the tobacco industry's denialist propaganda.\n\nClimate change threatens people with increased flooding, extreme heat, increased food and water scarcity, more disease, and economic loss. Human migration and conflict can also be a result. The World Health Organization calls climate change one of the biggest threats to global health in the 21st century. Societies and ecosystems will experience more severe risks without action to limit warming. Adapting to climate change through efforts like flood control measures or drought-resistant crops partially reduces climate change risks, although some limits to adaptation have already been reached. Poorer communities are responsible for a small share of global emissions, yet have the least ability to adapt and are most vulnerable to climate change.\n\nClimate change denial (also global warming denial) is a form of science denial characterized by rejecting, refusing to acknowledge, disputing, or fighting the scientific consensus on climate change, which is based on extensive and diverse evidence. Those promoting denial commonly use rhetorical tactics to give the appearance of a scientific controversy where none exists. Climate change denial includes raising unreasonable doubts about the extent to which climate change is caused by humans, its effects on nature and human society, and understating the costs of climate change adaptation while overstating the costs of mitigating it. To a lesser extent, climate change denial can also be implicit when people accept the science but fail to reconcile it with their belief or action. Several studies have analyzed these positions as forms of denialism, pseudoscience, or propaganda."
  },
  {
    "topic": "1956 Hungarian revolution",
    "question": "Which films and musical works explicitly reference the 1956 Hungarian Revolution's impact on families and athletes?",
    "expected": "Réka Pigniczky's 2006 film Journey Home and Szabadság, szerelem (Children of Glory) both depict familial and athletic ties to the revolution.",
    "reference": "Although the Hungarian Revolution of 1956 failed in its efforts to oust the ruling Communist government of Hungary, the uprising provided inspiration for many artists, writers, poets, composers and filmmakers.\n\n\n== Film ==\nMany movies and documentaries have been made about the revolution. They include:\n\nThe Forgotten Faces (1961), a short directed by Peter Watkins, filmed on the streets of Canterbury, England, which re-creates events from the revolution to great realistic effect.\nSzerelem (1971), directed by Károly Makk, which tells the story of an old woman and her daughter-in-law, and the effects on them of their son/husband's imprisonment during the revolution and of his return home from prison.\nSunshine (1999) by István Szabó covers the 1956 Revolution among other historical periods in Hungary.\nRéka Pigniczky's 2006 film Journey Home (Hazatérés), which tells the story of two sisters who try to find out what their father did as a freedom fighter during the Hungarian revolution of 1956. The story unfolds as the women take their father’s ashes from the U.S. to Hungary to fulfill his dying request to be buried in his native land.\nA number films have also dealt with the famous Hungary-USSR water polo match at the 1956 Olympics, including  Freedom's Fury, produced by Quentin Tarantino.\n\nSzabadság, szerelem (Children of Glory) A 2006 semi-fictional film by Hungarian director Kriszta Goda, depicting the effect of the 1956 Revolution on members of the 1956 Hungarian Olympic water polo team. A few weeks after Revolution was crushed, the Hungarian players find themselves up against the Soviet Union at a semifinal match.\n\n\n== Music ==\nDmitri Shostakovich's Eleventh Symphony, written in 1957, although subtitled \"The Year 1905\" and purporting to be a musical description of the ill-fated democratic uprising in Russia in that year, is often considered a commentary on the events in Hungary. Shostakovich makes frequent use of early 20th-century Russian revolutionary songs about the cruelty of the Tsar and the longing for freedom, and vividly depicts the violent crushing of the 1905 revolution. To Soviet audiences of the time, the analogy with the Hungarian revolution was unmistakable.\n\"Avanti ragazzi di Buda\" was published on 1966 by Pier Francesco Pingitore. It is a popular Italian song commemorating the events on the Hungarian Revolution of 1956, being known in Hungary as Előre budai srácok.\nChess, a musical by Benny Andersson and Björn Ulvaeus, with lyrics by Ulvaeus and Tim Rice, and book by Rice, references the uprising with the song \"1956 - Budapest Is Rising\".\n\n=== Soviet occupation ===\n\nAt the end of the Second World War (1939–1945), the Kingdom of Hungary was in the geopolitical sphere of influence of the USSR. In the political aftermath of the War, Hungary was a multi-party democracy, in which the 1945 Hungarian parliamentary election produced a coalition government composed of Independent Smallholders, Agrarian Workers and the Civic Party, headed by President Zoltán Tildy and Prime Minister Ferenc Nagy. Nonetheless, on behalf of the USSR, the Hungarian Communist Party continually used salami slicing tactics to wrest minor political concessions, which continually"
  },
  {
    "topic": "1956 Hungarian revolution",
    "question": "What Soviet-era artistic works drew parallels between the 1956 Hungarian Revolution and other historical uprisings?",
    "expected": "Dmitri Shostakovich's Eleventh Symphony and the Italian song 'Avanti ragazzi di Buda' implicitly compared the revolution to earlier struggles against authoritarian regimes.",
    "reference": "Although the Hungarian Revolution of 1956 failed in its efforts to oust the ruling Communist government of Hungary, the uprising provided inspiration for many artists, writers, poets, composers and filmmakers.\n\n\n== Film ==\nMany movies and documentaries have been made about the revolution. They include:\n\nThe Forgotten Faces (1961), a short directed by Peter Watkins, filmed on the streets of Canterbury, England, which re-creates events from the revolution to great realistic effect.\nSzerelem (1971), directed by Károly Makk, which tells the story of an old woman and her daughter-in-law, and the effects on them of their son/husband's imprisonment during the revolution and of his return home from prison.\nSunshine (1999) by István Szabó covers the 1956 Revolution among other historical periods in Hungary.\nRéka Pigniczky's 2006 film Journey Home (Hazatérés), which tells the story of two sisters who try to find out what their father did as a freedom fighter during the Hungarian revolution of 1956. The story unfolds as the women take their father’s ashes from the U.S. to Hungary to fulfill his dying request to be buried in his native land.\nA number films have also dealt with the famous Hungary-USSR water polo match at the 1956 Olympics, including  Freedom's Fury, produced by Quentin Tarantino.\n\nSzabadság, szerelem (Children of Glory) A 2006 semi-fictional film by Hungarian director Kriszta Goda, depicting the effect of the 1956 Revolution on members of the 1956 Hungarian Olympic water polo team. A few weeks after Revolution was crushed, the Hungarian players find themselves up against the Soviet Union at a semifinal match.\n\n\n== Music ==\nDmitri Shostakovich's Eleventh Symphony, written in 1957, although subtitled \"The Year 1905\" and purporting to be a musical description of the ill-fated democratic uprising in Russia in that year, is often considered a commentary on the events in Hungary. Shostakovich makes frequent use of early 20th-century Russian revolutionary songs about the cruelty of the Tsar and the longing for freedom, and vividly depicts the violent crushing of the 1905 revolution. To Soviet audiences of the time, the analogy with the Hungarian revolution was unmistakable.\n\"Avanti ragazzi di Buda\" was published on 1966 by Pier Francesco Pingitore. It is a popular Italian song commemorating the events on the Hungarian Revolution of 1956, being known in Hungary as Előre budai srácok.\nChess, a musical by Benny Andersson and Björn Ulvaeus, with lyrics by Ulvaeus and Tim Rice, and book by Rice, references the uprising with the song \"1956 - Budapest Is Rising\".\n\n=== Soviet occupation ===\n\nAt the end of the Second World War (1939–1945), the Kingdom of Hungary was in the geopolitical sphere of influence of the USSR. In the political aftermath of the War, Hungary was a multi-party democracy, in which the 1945 Hungarian parliamentary election produced a coalition government composed of Independent Smallholders, Agrarian Workers and the Civic Party, headed by President Zoltán Tildy and Prime Minister Ferenc Nagy. Nonetheless, on behalf of the USSR, the Hungarian Communist Party continually used salami slicing tactics to wrest minor political concessions, which continually"
  }
]